artillery.yml
config:
  target: "http://localhost:4043"
  phases:
    - duration: 60
      arrivalRate: 5
    #   rampTo: 2000
    # - duration: 60
    #   arrivalRate: 3500

scenarios:
  - flow:
      - loop:
          - get:
              url: "/product/{{ $randomNumber(1, 1000) }}"
            # - get:
            #     url: "/product/{{ $randomNumber(10000, 20000) }}"
            # - get:
            #     url: "/product/{{ $randomNumber(20000, 30000) }}"
            count: 500